In [2]:
import pandas as pd
import numpy as np

In [34]:
df = pd.read_csv('manager_salary_survery.csv')

In [4]:
df.head()

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",What country do you work in?,"If you're in the U.S., what state do you work in?",What city do you work in?,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.)
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

In [35]:
df = df.rename(columns={
    'Timestamp': 'timestamp',
    'How old are you?': 'age_group',
    'What industry do you work in?': 'industry',
    'Job title': 'job_title',
    'If your job title needs additional context, please clarify here:': 'job_context',
    "What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)": 'annual_salary',
    'How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.': 'additional_compensation',
    'Please indicate the currency': 'currency',
    'If "Other," please indicate the currency here: ': 'currency_other',
    'If your income needs additional context, please provide it here:': 'income_context',
    'What country do you work in?': 'country',
    "If you're in the U.S., what state do you work in?": 'state',
    'What city do you work in?': 'city',
    'How many years of professional work experience do you have overall?': 'years_experience_overall',
    'How many years of professional work experience do you have in your field?': 'years_experience_field',
    'What is your highest level of education completed?': 'highest_level_education',
    'What is your gender?': 'gender',
    "What is your race? (Choose all that apply.)": 'race'

})

In [7]:
df.head()

,timestamp,age_group,industry,job_title,job_context,annual_salary,additional_compensation,currency,currency_other,income_context,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,race
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28180 entries, 0 to 28179
Data columns (total 18 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   timestamp                 28180 non-null  object
 1   age_group                 28180 non-null  object
 2   industry                  28099 non-null  object
 3   job_title                 28178 non-null  object
 4   job_context               7284 non-null   object
 5   annual_salary             28180 non-null  object
 6   additional_compensation   20824 non-null  float64
 7   currency                  28180 non-null  object
 8   currency_other            217 non-null    object
 9   income_context            3050 non-null   object
 10  country                   28180 non-null  object
 11  state                     23124 non-null  object
 12  city                      28098 non-null  object
 13  years_experience_overall  28180 non-null  object
 14  years_experience_field    28180 non-null  object
 15  highest_level_education   27944 non-null  object
 16  gender                    27998 non-null  object
 17  race                      27990 non-null  object
dtypes: float64(1), object(17)
memory usage: 3.9+ MB

In [9]:
df.describe()

       additional_compensation
count             2.082400e+04
mean              1.823083e+04
std               8.330045e+05
min               0.000000e+00
25%               0.000000e+00
50%               2.000000e+03
75%               1.000000e+04
max               1.200000e+08

In [10]:
df.isna().sum()

timestamp                       0
age_group                       0
industry                       81
job_title                       2
job_context                 20896
annual_salary                   0
additional_compensation      7356
currency                        0
currency_other              27963
income_context              25130
country                         0
state                        5056
city                           82
years_experience_overall        0
years_experience_field          0
highest_level_education       236
gender                        182
race                          190
dtype: int64

In [37]:
df = df.drop(columns=['job_context', 'currency_other', 'income_context'])

In [22]:
df.isna().sum()

timestamp                      0
age_group                      0
industry                      81
job_title                      2
annual_salary                  0
additional_compensation     7356
currency                       0
country                        0
state                       5056
city                          82
years_experience_overall       0
years_experience_field         0
highest_level_education      236
gender                       182
race                         190
dtype: int64

In [39]:
df['timestamp'] = pd.to_datetime(df['timestamp'])

In [ ]:
df['industry'].to_csv('industry.csv', index = False)

In [75]:
map_cleaned = pd.read_csv('map_industry.csv')

In [77]:
map_cleaned

                           industry                   Grouped industry
0      Education (Higher Education)                          Education
1                 Computing or Tech                    Technology & IT
2     Accounting, Banking & Finance                            Finance
3                        Nonprofits            Non-Profit Organization
4                        Publishing               Arts Media & Culture
...                             ...                                ...
1219                Social networks  Healthcare, Pharma & Life Science
1220                            ABA                      Miscellaneous
1221                     psychology  Healthcare, Pharma & Life Science
1222                         School                          Education
1223                      lifeguard                      Miscellaneous

[1224 rows x 2 columns]

In [82]:
merge_df = df.merge(map_cleaned, on = 'industry', how='left')

In [79]:
merge_df.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,race,Grouped industry
0,2021-04-27 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,"55,000",0.0,USD,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White,Education
1,2021-04-27 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,"54,600",4000.0,GBP,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White,Technology & IT
2,2021-04-27 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,"34,000",NaN,USD,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White,Finance
3,2021-04-27 11:02:41,25-34,Nonprofits,Program Manager,"62,000",3000.0,USD,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White,Non-Profit Organization
4,2021-04-27 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,"60,000",7000.0,USD,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White,Finance

In [87]:
merge_df['industry'] = merge_df['Grouped industry']

In [88]:
merge_df.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,race,Grouped industry
0,2021-04-27 11:02:10,25-34,Education,Research and Instruction Librarian,"55,000",0.0,USD,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White,Education
1,2021-04-27 11:02:22,25-34,Technology & IT,Change & Internal Communications Manager,"54,600",4000.0,GBP,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White,Technology & IT
2,2021-04-27 11:02:38,25-34,Finance,Marketing Specialist,"34,000",NaN,USD,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White,Finance
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,Program Manager,"62,000",3000.0,USD,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White,Non-Profit Organization
4,2021-04-27 11:02:42,25-34,Finance,Accounting Manager,"60,000",7000.0,USD,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White,Finance

In [89]:
merge_df.drop(columns='Grouped industry', inplace=True)

In [90]:
merge_df.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,race
0,2021-04-27 11:02:10,25-34,Education,Research and Instruction Librarian,"55,000",0.0,USD,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,2021-04-27 11:02:22,25-34,Technology & IT,Change & Internal Communications Manager,"54,600",4000.0,GBP,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,2021-04-27 11:02:38,25-34,Finance,Marketing Specialist,"34,000",NaN,USD,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,Program Manager,"62,000",3000.0,USD,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,2021-04-27 11:02:42,25-34,Finance,Accounting Manager,"60,000",7000.0,USD,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

In [93]:
merge_df.isna().sum()

timestamp                      0
age_group                      0
industry                     376
job_title                      2
annual_salary                  0
additional_compensation     7575
currency                       0
country                        0
state                       5222
city                          89
years_experience_overall       0
years_experience_field         0
highest_level_education      244
gender                       187
race                         192
dtype: int64

In [153]:
merge_df['job_title'] =merge_df.job_title.str.strip().str.lower()

In [108]:
merge_df['job_title'].str.lower().str.strip().drop_duplicates().to_csv('jobtitle.csv')

In [155]:
job = pd.read_csv('jobtitlefixed.csv')

In [221]:
new = merge_df.merge(job, on = 'job_title', how = 'left')

In [222]:
new.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,race,job_category,position
0,2021-04-27 11:02:10,25-34,Education,research and instruction librarian,"55,000",0.0,USD,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White,Management,NaN
1,2021-04-27 11:02:22,25-34,Technology & IT,change & internal communications manager,"54,600",4000.0,GBP,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White,Management,NaN
2,2021-04-27 11:02:38,25-34,Finance,marketing specialist,"34,000",NaN,USD,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White,Marketing & Sales,NaN
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,program manager,"62,000",3000.0,USD,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White,Management,NaN
4,2021-04-27 11:02:42,25-34,Finance,accounting manager,"60,000",7000.0,USD,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White,Management,NaN

In [223]:
new['job_title']= new.job_title.str.replace(',', '').str.title()

In [167]:
new.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,race,job_category,position
0,2021-04-27 11:02:10,25-34,Education,Research And Instruction Librarian,"55,000",0.0,USD,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White,Management,NaN
1,2021-04-27 11:02:22,25-34,Technology & IT,Change & Internal Communications Manager,"54,600",4000.0,GBP,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White,Management,NaN
2,2021-04-27 11:02:38,25-34,Finance,Marketing Specialist,"34,000",NaN,USD,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White,Marketing & Sales,NaN
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,Program Manager,"62,000",3000.0,USD,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White,Management,NaN
4,2021-04-27 11:02:42,25-34,Finance,Accounting Manager,"60,000",7000.0,USD,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White,Management,NaN

In [226]:
new['annual_salary']=new.annual_salary.str.replace(',', '').astype(int)

In [180]:
new.country.unique()

array(['United States', 'United Kingdom', 'US', 'USA', 'Canada',
       'United Kingdom ', 'usa', 'UK', 'Scotland ', 'U.S.',
       'United States ', 'The Netherlands', 'Australia ', 'Spain', 'us',
       'Usa', 'England', 'finland', 'United States of America', 'France',
       'United states', 'Scotland', 'USA ', 'United states ', 'Germany',
       'UK ', 'united states', 'Ireland', 'India', 'Australia', 'Uk',
       'United States of America ', 'U.S. ', 'canada', 'Canada ', 'U.S>',
       'ISA', 'Argentina', 'Great Britain ', 'US ', 'United State',
       'U.S.A', 'Denmark', 'U.S.A.', 'America', 'Netherlands',
       'netherlands', 'England ', 'united states of america', 'Ireland ',
       'Switzerland', 'Netherlands ', 'Bermuda', 'Us',
       'The United States', 'United State of America', 'Germany ',
       'Malaysia', 'Mexico ', 'United Stated', 'South Africa ', 'Belgium',
       'Northern Ireland', 'u.s.', 'South Africa', 'UNITED STATES',
       'united States', 'Sweden', 'Hong Kong', 'Kuwait', 'Norway',
       'Sri lanka', 'Contracts', 'USA-- Virgin Islands', 'United Statws',
       'England/UK', 'U.S',
       "We don't get raises, we get quarterly bonuses, but they periodically asses income in the area you work, so I got a raise because a 3rd party assessment showed I was paid too little for the area we were located",
       'Unites States ', 'Usa ', 'U.S.A. ', 'England, UK.', 'Greece',
       'Japan', 'U. S. ', 'Britain ', 'United Sates', 'Japan ', 'Austria',
       'Brazil', 'Canada, Ottawa, ontario', 'Global', 'Sweden ',
       'United States of American ', 'FRANCE', 'Uniited States',
       'United Kingdom (England)',
       'Worldwide (based in US but short term trips aroudn the world)',
       'CANADA ', 'Canadw', 'Hungary', 'Luxembourg',
       'United Sates of America', 'ireland',
       'United States (I work from home and my clients are all over the US/Canada/PR',
       'Colombia', 'CANADA', 'Unted States', 'germany', 'United Statesp',
       'United Stattes', 'United Statea', 'United Kingdom.', 'Mexico',
       'New Zealand', 'Trinidad and Tobago', 'Unites States',
       'United Statees', 'United kingdom', 'Cayman Islands',
       'UNited States', 'Can',
       'I am located in Canada but I work for a company in the US',
       'United kingdom ', 'Uniyed states', 'Uniyes States',
       'United States of Americas', 'U.A.', 'Czech republic', 'Czechia',
       'Latvia', 'Finland', 'U. S.', 'Puerto Rico', 'US of A', 'Rwanda',
       'United States of america ', 'United Arab Emirates ',
       'Bangladesh ', 'Spain ', 'U.K. ', 'Romania', 'U.SA',
       'United Kindom', 'United Status', 'New Zealand ',
       'Currently finance', ' U.S.', 'Serbia', 'Philippines', 'Russia ',
       'Poland', 'UXZ', 'czech republic', 'England, UK', 'Turkey',
       'Canda', 'Puerto Rico ', 'Canada and USA', 'Catalonia',
       '$2,175.84/year is deducted for benefits', 'uk', 'France ',
       'Italy (South)', 'Jersey, Channel islands', 'Uk ', 'China',
       'Virginia', 'Afghanistan', 'Israel', 'U.s.', 'Great Britain',
       'U.s.a.', 'USS', 'Denmark ', 'Uniteed States',
       'New Zealand Aotearoa', 'U.K.', 'Hartford',
       'Japan, US Gov position', 'Csnada', 'United Stares', 'New zealand',
       'Mainland China', 'I.S.', 'UK (Northern Ireland)',
       'UK for U.S. company', ' US', 'Unites states ', 'NZ', 'Us ',
       'Hong Kong ', 'Taiwan', 'Canad', 'Unite States', 'australia',
       'The US', 'united states ', 'The Netherlands ', 'Cambodia',
       'United states of America ', 'Vietnam', 'Remote', 'Singapore',
       'South Korea', 'Czech Republic ', 'Thailand', 'Bangladesh',
       'Lithuania', 'Eritrea', 'Indonesia', 'Singapore ',
       'For the United States government, but posted overseas', 'IS',
       'Switzerland ', 'United Kingdomk', 'Italy', ' New Zealand', 'Cuba',
       'Slovenia', 'Australi', "Cote d'Ivoire", 'united kingdom',
       'From Romania, but for an US based company', 'Somalia',
       'Wales (United Kingdom)', 'England, Gb', 'Czech Republic',
       'UnitedStates', 'Sri Lanka', 'spain', 'Danmark',
       'U.K. (northern England)', 'U.K', 'NL', 'the Netherlands',
       'Nederland', 'Slovakia', 'United States of america', 'Portugal ',
       'England, United Kingdom', 'Sierra Leone', 'Englang',
       'United statew', 'UAE', 'Belgium ',
       'bonus based on meeting yearly goals set w/ my supervisor',
       'International ', 'The Bahamas ', 'Wales',
       "I earn commission on sales. If I meet quota, I'm guaranteed another 16k min. Last year i earned an additional 27k. It's not uncommon for people in my space to earn 100k+ after commission. ",
       'Costa Rica', ' United States', 'United Statues', 'Untied States',
       'USA (company is based in a US territory, I work remote)', 'Chile',
       'denmark', 'UK (England)', 'UK, remote', 'Scotland, UK', 'USAB',
       'Unitied States', 'Norway ', 'Qatar', 'United Sttes',
       'Remote (philippines)', 'Brazil ', 'Unites kingdom ',
       'South africa', 'Portugal', 'united stated',
       'United States Of America', 'Nigeria', 'PanamÃ¡',
       'Northern Ireland ', 'england', 'SWITZERLAND',
       'Austria, but I work remotely for a Dutch/British company',
       "I work for an US based company but I'm from Argentina.",
       'I was brought in on this salary to help with the EHR and very quickly was promoted to current position but compensation was not altered. ',
       'Uniter Statez', 'U. S ', 'Congo', 'United states of America',
       'Uruguay', 'Pakistan', 'Brasil', 'USA tomorrow ', 'United Stateds',
       'n/a (remote from wherever I want)', 'singapore',
       'US govt employee overseas, country withheld', 'usa ', 'Malaysia ',
       'Uganda', 'Malta', 'Saudi Arabia', 'Bulgaria', 'Estonia',
       'Morocco', 'new zealand', 'Africa', 'Ecuador', 'Zimbabwe', 'Ghana',
       'San Francisco', 'Usat', 'ðŸ‡ºðŸ‡¸ ', 'Luxemburg', 'Unitef Stated', 'UA',
       'Wales, UK', 'United Stares ', 'Croatia ',
       'England, United Kingdom ', 'United STates', 'USaa', 'uSA',
       'South Korea ', 'The netherlands', 'Ukraine ', 'america',
       'switzerland', 'United States- Puerto Rico',
       'From New Zealand but on projects across APAC', 'Y', 'United y',
       'Wales (UK)', 'Isle of Man', 'Northern Ireland, United Kingdom',
       'europe', 'California ',
       'UK, but for globally fully remote company', 'Australian ',
       'MÃ©xico', 'Jamaica', 'uS', 'USD', 'the netherlands',
       "USA, but for foreign gov't", 'japan', 'Kenya', 'Jordan',
       'United Statss', 'ARGENTINA BUT MY ORG IS IN THAILAND',
       'United states of america', 'UsA',
       'I work for a UAE-based organization, though I am personally in the US.',
       'United  States', 'france', 'Aotearoa New Zealand', 'na', 'Policy',
       'Cyprus', 'hong konh', 'United States is America', 'Liechtenstein',
       'Company in Germany. I work from Pakistan.', 'croatia', 'CanadÃ¡',
       'ENGLAND', 'United States of American', 'U.S.A ', 'INDIA',
       'Bosnia and Herzegovina', 'NIGERIA', 'Poland ', 'pakistan',
       'Nigeria ', 'London', 'ss', 'dbfemf', 'ibdia', 'LOUTRELAND',
       'philippines', 'ff', 'Myanmar', 'Burma', 'india', 'Tanzania',
       'ÄŒeskÃ¡ republika', 'Italia', 'Hong KongKong', 'Egypt', 'Thailand ',
       'Liberia', '1'], dtype=object)

In [230]:
new.country.value_counts().tail(50)

country
 United States                                                                                                                                                                                  1
United Statues                                                                                                                                                                                  1
Untied States                                                                                                                                                                                   1
USA (company is based in a US territory, I work remote)                                                                                                                                         1
United States (I work from home and my clients are all over the US/Canada/PR                                                                                                                    1
UK, remote                                                                                                                                                                                      1
USAB                                                                                                                                                                                            1
Unitied States                                                                                                                                                                                  1
Canadw                                                                                                                                                                                          1
Qatar                                                                                                                                                                                           1
United Sttes                                                                                                                                                                                    1
Remote (philippines)                                                                                                                                                                            1
Brazil                                                                                                                                                                                          1
Unites kingdom                                                                                                                                                                                  1
CANADA                                                                                                                                                                                          1
Worldwide (based in US but short term trips aroudn the world)                                                                                                                                   1
united stated                                                                                                                                                                                   1
Uniited States                                                                                                                                                                                  1
PanamÃ¡                                                                                                                                                                                          1
FRANCE                                                                                                                                                                                          1
Italy (South)                                                                                                                                                                                   1
SWITZERLAND                                                                                                                                                                                     1
Austria, but I work remotely for a Dutch/British company                                                                                                                                        1
Costa Rica                                                                                                                                                                                      1
I earn commission on sales. If I meet quota, I'm guaranteed another 16k min. Last year i earned an additional 27k. It's not uncommon for people in my space to earn 100k+ after commission.     1
Unted States                                                                                                                                                                                    1
Nederland                                                                                                                                                                                       1
England, Gb                                                                                                                                                                                     1
Cayman Islands                                                                                                                                                                                  1
United Statees                                                                                                                                                                                  1
Sri Lanka                                                                                                                                                                                       1
Trinidad and Tobago                                                                                                                                                                             1
Danmark                                                                                                                                                                                         1
U.K. (northern England)                                                                                                                                                                         1
U.K                                                                                                                                                                                             1
NL                                                                                                                                                                                              1
the Netherlands                                                                                                                                                                                 1
Slovakia                                                                                                                                                                                        1
The Bahamas                                                                                                                                                                                     1
United Kingdom.                                                                                                                                                                                 1
Portugal                                                                                                                                                                                        1
United Stattes                                                                                                                                                                                  1
Sierra Leone                                                                                                                                                                                    1
Englang                                                                                                                                                                                         1
United statew                                                                                                                                                                                   1
UAE                                                                                                                                                                                             1
United Statesp                                                                                                                                                                                  1
bonus based on meeting yearly goals set w/ my supervisor                                                                                                                                        1
International                                                                                                                                                                                   1
1                                                                                                                                                                                               1
Name: count, dtype: int64

In [232]:
new['country'] = new['country'].str.lower().str.strip()

In [233]:
new['country'].dropna().drop_duplicates().to_csv('country.csv', index= False)

In [235]:
map_df = pd.read_csv("country_cleaned.csv")
country_map = dict(zip(map_df['country'], map_df['Fixed']))
new['country_clean'] = new['country'].map(country_map)

In [239]:
new['country'] = new['country_clean']

In [241]:
new = new.drop('country_clean', axis = 1)

In [250]:
new['country'] = new['country'].str.replace('Canda', 'Canada')

In [303]:
new.country.unique()

mapc = {
    'austrailia': 'australia',
    'isa': 'shit',
    'unites states': 'united states',
    'england': 'united kingdom',
    'uniited states': 'united states',
    'unted states': 'united states',
    'uniyed states': 'united states',
    'uniyes states': 'united states',
    'catalonia': 'spain',
    'uniteed states': 'united states',
    'untied states': 'united states',
    'unitied states': 'united states',
    'brasil': 'brazil'
}

new['country'] =new['country'].replace(mapc)

In [304]:
new.country.unique()

array(['united states', 'united kingdom', 'canada', 'scotland',
       'netherlands', 'australia', 'spain', 'finland', 'france',
       'germany', 'ireland', 'india', 'shit', 'argentina', 'denmark',
       'switzerland', 'bermuda', 'malaysia', 'mexico', 'south africa',
       'belgium', 'sweden', 'hong kong', 'kuwait', 'norway', 'sri lanka',
       nan, 'greece', 'japan', 'austria', 'brazil', 'global', 'hungary',
       'luxembourg', 'colombia', 'new zealand', 'trinidad and tobago',
       'cayman islands', 'czech republic', 'latvia', 'puerto rico',
       'rwanda', 'united arab emirates', 'bangladesh', 'romania',
       'serbia', 'philippines', 'russia', 'poland', 'turkey', 'italy',
       'china', 'afghanistan', 'israel', 'taiwan', 'cambodia', 'vietnam',
       'remote', 'singapore', 'south korea', 'thailand', 'lithuania',
       'eritrea', 'indonesia', 'cuba', 'slovenia', "cote d'ivoire",
       'somalia', 'slovakia', 'portugal', 'sierra leone', 'bahamas',
       'costa rica', 'chile', 'qatar', 'nigeria', 'panama', 'congo',
       'uruguay', 'pakistan', 'uganda', 'malta', 'saudi arabia',
       'bulgaria', 'estonia', 'morocco', 'africa', 'ecuador', 'zimbabwe',
       'ghana', 'luxemburg', 'croatia', 'ukraine', 'isle of man',
       'europe', 'jamaica', 'kenya', 'jordan', 'cyprus', 'liechtenstein',
       'bosnia', 'ibdia', 'myanmar', 'burma', 'tanzania', 'egypt',
       'liberia'], dtype=object)

In [559]:
currency_new = pd.read_csv("currency_cleaned.csv")
currency_new['country'] = currency_new['country'].str.lower().str.strip()
new['country'] = new['country'].str.lower().str.strip()
pr = new.merge(currency_new, on = 'country', how = 'left')

In [560]:
pr['currency'] = pr['currencyfx']

In [561]:
pr = pr.drop(columns=['currency_new', 'currencyfx'], axis = 1)

In [562]:
pr = pr.drop(columns=['position'], axis = 1)

In [496]:
pr[['annual_salary', 'currency', 'country']].head()

   annual_salary currency         country
0          55000      USD   united states
1          54600      GBP  united kingdom
2          34000      USD   united states
3          62000      USD   united states
4          60000      USD   united states

In [458]:
pr.isna().sum()

timestamp                       0
age_group                       0
industry                      381
job_title                       6
annual_salary                   0
additional_compensation      7594
currency                       42
country                        17
state                        5276
city                           92
years_experience_overall        0
years_experience_field          0
highest_level_education       246
gender                        188
race                          195
job_category                    0
level                       23590
dtype: int64

In [ ]:
# import requests

# test = pr.copy(deep=True)

# response = requests.get('https://api.exchangerate-api.com/v4/latest/USD')
# exchange_rates = response.json().get('rates', {})

# print(exchange_rates)
# def convert_to_usd(row):
#     salary = row['annual_salary']
#     currency = row['currency']
#     if currency == 'USD':
#         return salary
#     rate = exchange_rates.get(currency)
#     if rate:
#         return round(salary / rate, 2)  # divide by rate
#     else:
#         return None

# test['annual_salary_usd'] = test.apply(convert_to_usd, axis=1)
# print(test)


# test = pr.copy(deep=True)

# response = requests.get('https://api.exchangerate-api.com/v4/latest/USD')
# exchange_rates = response.json().get('rates', {})
# exchange_rates['USD'] = 1.0  # Add USD to itself for safety purpose

# # Create a mapping series for vectorized operation
# currency_rates = pd.Series(exchange_rates)
# print(currency_rates)
# # Vectorized conversion - MUCH faster for 14,000 rows
# test['annual_salary_usd'] = (
#     test['annual_salary'] / test['currency'].map(currency_rates)
# ).round(2)

# print(test.head())
# print(f"Processed {len(test)} rows in one vectorized operation")

In [563]:
import requests

get_data = requests.get('https://api.exchangerate-api.com/v4/latest/USD')
data = get_data.json().get('rates',{})

current_rates = pd.Series(data)

pr['annual_salary_usd'] = (pr['annual_salary'] / pr['currency'].map(current_rates)).round()

In [359]:
pr.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,race,job_category,level,annual_salary_usd
0,2021-04-27 11:02:10,25-34,Education,research and instruction librarian,55000,0.0,USD,united states,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White,Management,NaN,55000.0
1,2021-04-27 11:02:22,25-34,Technology & IT,change & internal communications manager,54600,4000.0,GBP,united kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White,Management,NaN,72897.0
2,2021-04-27 11:02:38,25-34,Finance,marketing specialist,34000,NaN,USD,united states,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White,Marketing & Sales,NaN,34000.0
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,program manager,62000,3000.0,USD,united states,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White,Management,NaN,62000.0
4,2021-04-27 11:02:42,25-34,Finance,accounting manager,60000,7000.0,USD,united states,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White,Management,NaN,60000.0

In [564]:
pr = pr.drop(columns='race', axis=1)

In [385]:
pr[pr['annual_salary_usd']==4285764286.0]

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,race,job_category,level,annual_salary_usd
29106,2024-07-12 18:25:27,18-24,Finance,investment banking analyst,6000070000,NaN,CAD,canada,NaN,Toronto,2 - 4 years,1 year or less,College degree,Woman,Black or African American,Analytics,NaN,4.285764e+09

In [407]:
pr.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,job_category,level,annual_salary_usd
0,2021-04-27 11:02:10,25-34,Education,research and instruction librarian,55000.0,0.0,USD,united states,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,Management,NaN,55000.0
1,2021-04-27 11:02:22,25-34,Technology & IT,change & internal communications manager,72897.0,4000.0,GBP,united kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,Management,NaN,72897.0
2,2021-04-27 11:02:38,25-34,Finance,marketing specialist,34000.0,NaN,USD,united states,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,Marketing & Sales,NaN,34000.0
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,program manager,62000.0,3000.0,USD,united states,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,Management,NaN,62000.0
4,2021-04-27 11:02:42,25-34,Finance,accounting manager,60000.0,7000.0,USD,united states,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,Management,NaN,60000.0

In [565]:
pr['annual_salary'] = pr['annual_salary_usd']

In [566]:
pr = pr.drop(columns='annual_salary_usd')

In [463]:
pr.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,job_category,level
0,2021-04-27 11:02:10,25-34,Education,research and instruction librarian,55000.0,0.0,USD,united states,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,Management,NaN
1,2021-04-27 11:02:22,25-34,Technology & IT,change & internal communications manager,72897.0,4000.0,GBP,united kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,Management,NaN
2,2021-04-27 11:02:38,25-34,Finance,marketing specialist,34000.0,NaN,USD,united states,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,Marketing & Sales,NaN
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,program manager,62000.0,3000.0,USD,united states,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,Management,NaN
4,2021-04-27 11:02:42,25-34,Finance,accounting manager,60000.0,7000.0,USD,united states,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,Management,NaN

In [464]:
pr.isna().sum()

timestamp                       0
age_group                       0
industry                      381
job_title                       6
annual_salary                  42
additional_compensation      7594
currency                       42
country                        17
state                        5276
city                           92
years_experience_overall        0
years_experience_field          0
highest_level_education       246
gender                        188
job_category                    0
level                       23590
dtype: int64

In [548]:
pr.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,job_category,level,year,month
0,2021-04-27 11:02:10,25-34,Education,research and instruction librarian,55000.0,0.0,USD,united states,Massachusetts,Boston,6.0,6.0,Masters,Woman,Management,NaN,2021,4
1,2021-04-27 11:02:22,25-34,Technology & IT,change & internal communications manager,72897.0,4000.0,GBP,united kingdom,NaN,Cambridge,9.0,6.0,College,Non-binary,Management,NaN,2021,4
2,2021-04-27 11:02:38,25-34,Finance,marketing specialist,34000.0,NaN,USD,united states,Tennessee,Chattanooga,3.0,3.0,College,Woman,Marketing & Sales,NaN,2021,4
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,program manager,62000.0,3000.0,USD,united states,Wisconsin,Milwaukee,9.0,6.0,College,Woman,Management,NaN,2021,4
4,2021-04-27 11:02:42,25-34,Finance,accounting manager,60000.0,7000.0,USD,united states,South Carolina,Greenville,9.0,6.0,College,Woman,Management,NaN,2021,4

In [433]:
pr[['years_experience_overall', 'years_experience_field']].head()

  years_experience_overall years_experience_field
0                5-7 years              5-7 years
1             8 - 10 years              5-7 years
2              2 - 4 years            2 - 4 years
3             8 - 10 years              5-7 years
4             8 - 10 years              5-7 years

In [567]:
pr['year'] = pr['timestamp'].dt.year

In [568]:
pr['month'] = pr['timestamp'].dt.month

In [569]:
pr['years_experience_overall'].value_counts().head(100)

map_year = {
    '11 - 20 years': 15.5,
    '8 - 10 years': 9,
    '5-7 years': 6,    
    '21 - 30 years': 25.5,   
    '2 - 4 years': 3,
    '31 - 40 years': 35.5,
    '1 year or less': 0.5,
    '41 years or more': 40,
}

pr['years_experience_overall'] = pr['years_experience_overall'].map(map_year)

In [570]:
pr['years_experience_field'] = pr['years_experience_field'].map(map_year)

In [597]:
pr.isna().sum()

timestamp                      0
age_group                      0
industry                       0
job_title                      0
annual_salary                  0
additional_compensation     7453
currency                       0
country                        0
state                          0
city                           0
years_experience_overall       0
years_experience_field         0
highest_level_education        0
gender                         0
job_category                   0
level                          0
year                           0
month                          0
dtype: int64

In [571]:
pr = pr.dropna(subset=['industry'])

In [572]:
pr = pr.dropna(subset=['job_title'])

In [573]:

pr = pr.dropna(subset=['annual_salary','currency', 'country',  'city'])

In [578]:
pr['gender'].unique()

array(['Woman', 'Non-binary', 'Man', nan, 'Other or prefer not to answer',
       'Prefer not to answer'], dtype=object)

In [574]:
pr.highest_level_education.unique()

map_ed = {
    "Master's degree": 'Masters',
    'College degree': 'College', 
    'PhD': 'PhD',
    'Some college': 'College',
    'High School': 'High School', 
    'Professional degree (MD, JD, etc.)': 'Professional Degree'
}

pr['highest_level_education'] = pr['highest_level_education'].map(map_ed)

In [575]:
pr['highest_level_education'] = pr['highest_level_education'].fillna('Unknown')

In [579]:
pr['gender'].value_counts()

map_gender = {
    'Woman': 'Woman',
    'Man': 'Man',
    'Non-binary': 'Man',
    'Other or prefer not to answer': 'Prefer Not to Answer',
    'Prefer not to answer': 'Prefer Not to Answer'
}
pr['gender'] = pr['gender'].map(map_gender)

In [581]:
pr['gender'] = pr['gender'].fillna('Man')

In [582]:
pr['gender'].value_counts()

gender
Woman                   21834
Man                      6588
Prefer Not to Answer      305
Name: count, dtype: int64

In [584]:
pr['level'] = pr['level'].fillna('Not Classified')

In [591]:
pr['state'] = pr['state'].str.lower().str.strip().str.title()

In [596]:
pr['state'] = pr['state'].fillna('N/A')

In [599]:
pr['additional_compensation'] = pr['additional_compensation'].fillna(0)

In [606]:
pr.head()

,timestamp,age_group,industry,job_title,annual_salary,additional_compensation,currency,country,state,city,years_experience_overall,years_experience_field,highest_level_education,gender,job_category,level,year,month
0,2021-04-27 11:02:10,25-34,Education,research and instruction librarian,55000.0,0.0,USD,united states,Massachusetts,Boston,6.0,6.0,Masters,Woman,Management,Not Classified,2021,4
1,2021-04-27 11:02:22,25-34,Technology & IT,change & internal communications manager,72897.0,4000.0,GBP,united kingdom,N/A,Cambridge,9.0,6.0,College,Man,Management,Not Classified,2021,4
2,2021-04-27 11:02:38,25-34,Finance,marketing specialist,34000.0,0.0,USD,united states,Tennessee,Chattanooga,3.0,3.0,College,Woman,Marketing & Sales,Not Classified,2021,4
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,program manager,62000.0,3000.0,USD,united states,Wisconsin,Milwaukee,9.0,6.0,College,Woman,Management,Not Classified,2021,4
4,2021-04-27 11:02:42,25-34,Finance,accounting manager,60000.0,7000.0,USD,united states,South Carolina,Greenville,9.0,6.0,College,Woman,Management,Not Classified,2021,4

In [607]:
pr['age_group'].head()

0    25-34
1    25-34
2    25-34
3    25-34
4    25-34
Name: age_group, dtype: object

In [608]:
import requests

get_data = requests.get('https://api.exchangerate-api.com/v4/latest/USD')
data = get_data.json().get('rates',{})

current_rates = pd.Series(data)

pr['compensation_usd'] = (pr['additional_compensation'] / pr['currency'].map(current_rates)).round()

In [610]:
pr['additional_compensation'] = pr['compensation_usd']

In [611]:
pr = pr.drop(columns='compensation_usd')

In [625]:
pr.head()

,timestamp,age_group,industry,job_title,annual_salary_usd,compensation_usd,currency,country,state,city,overall_exp,field_exp,degree,gender,job_category,level,year,month,age_numeric
0,2021-04-27 11:02:10,25-34,Education,Research And Instruction Librarian,55000.0,0.0,USD,United States,Massachusetts,Boston,6.0,6.0,Masters,Woman,Management,Not Classified,2021,4,29.5
1,2021-04-27 11:02:22,25-34,Technology & IT,Change & Internal Communications Manager,72897.0,5340.0,GBP,United Kingdom,N/A,Cambridge,9.0,6.0,College,Man,Management,Not Classified,2021,4,29.5
2,2021-04-27 11:02:38,25-34,Finance,Marketing Specialist,34000.0,0.0,USD,United States,Tennessee,Chattanooga,3.0,3.0,College,Woman,Marketing & Sales,Not Classified,2021,4,29.5
3,2021-04-27 11:02:41,25-34,Non-Profit Organization,Program Manager,62000.0,3000.0,USD,United States,Wisconsin,Milwaukee,9.0,6.0,College,Woman,Management,Not Classified,2021,4,29.5
4,2021-04-27 11:02:42,25-34,Finance,Accounting Manager,60000.0,7000.0,USD,United States,South Carolina,Greenville,9.0,6.0,College,Woman,Management,Not Classified,2021,4,29.5

In [613]:
pr['job_title'] = pr['job_title'].str.title()
pr['country'] = pr['country'].str.title()
pr['city'] = pr['city'].str.strip().str.title()

In [616]:
pr['age_group'].value_counts()

age_group
25-34         12967
35-44         10093
45-54          3249
18-24          1293
55-64          1016
65 or over       97
under 18         12
Name: count, dtype: int64

In [619]:
age_map = {
    'under 18': 16,
    '18-24': 21,
    '25-34': 29.5,
    '35-44': 39.5,
    '45-54': 49.5,
    '55-64': 59.5,
    '65 or over': 70
}

pr['age_numeric'] = pr['age_group'].map(age_map)

In [630]:
pr.isna().sum()

timestamp            0
age_group            0
industry             0
job_title            0
annual_salary_usd    0
compensation_usd     0
currency             0
country              0
state                0
city                 0
overall_exp          0
field_exp            0
degree               0
gender               0
job_category         0
level                0
year                 0
month                0
age_numeric          0
dtype: int64

In [629]:
pr.to_csv('project_cleaned_V1.0.csv', index=False)

In [623]:
pr = pr.rename(columns={
    'annual_salary': 'annual_salary_usd',
    'additional_compensation': 'compensation_usd',
    'years_experience_overall': 'overall_exp',
    'years_experience_field': 'field_exp',
    'highest_level_education': 'degree',
})

In [639]:
pr['state'].str.lower().str.strip().value_counts()

state
n/a                    5154
california             2657
new york               2226
massachusetts          1571
texas                  1294
                       ...
new york, texas           1
california, montana       1
iowa, utah, vermont       1
texas, virginia           1
florida, georgia          1
Name: count, Length: 134, dtype: int64

In [640]:
pr['city'].value_counts()

city
Boston                    856
Chicago                   845
New York                  834
Seattle                   754
London                    633
                         ...
Bay Of Plenty               1
Prefer Not To Identify      1
Williamstown                1
Rancho Cucamonga            1
Commerce Township           1
Name: count, Length: 3859, dtype: int64

In [642]:
pr.info()

<class 'pandas.core.frame.DataFrame'>
Index: 28727 entries, 0 to 29237
Data columns (total 19 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   timestamp          28727 non-null  datetime64[ns]
 1   age_group          28727 non-null  object
 2   industry           28727 non-null  object
 3   job_title          28727 non-null  object
 4   annual_salary_usd  28727 non-null  float64
 5   compensation_usd   28727 non-null  float64
 6   currency           28727 non-null  object
 7   country            28727 non-null  object
 8   state              28727 non-null  object
 9   city               28727 non-null  object
 10  overall_exp        28727 non-null  float64
 11  field_exp          28727 non-null  float64
 12  degree             28727 non-null  object
 13  gender             28727 non-null  object
 14  job_category       28727 non-null  object
 15  level              28727 non-null  object
 16  year               28727 non-null  int32
 17  month              28727 non-null  int32
 18  age_numeric        28727 non-null  float64
dtypes: datetime64[ns](1), float64(5), int32(2), object(11)
memory usage: 4.2+ MB